# üóÑÔ∏è Advanced SQL ‚Äì Day 17 (GROUP BY & Aggregates)

**Goal:**  
Learn how to summarize and analyze data with:  
- Aggregate functions (`COUNT`, `AVG`, `MAX`, `MIN`)  
- GROUP BY  
- HAVING clause

#  1. Setup (same database as before)

In [12]:
import sqlite3
import pandas as pd

conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

# 2. Create Tables Again

In [13]:
cursor.execute("""
CREATE TABLE students (
    student_id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER,
    major TEXT
)
""")

cursor.execute("""
CREATE TABLE courses (
    course_id INTEGER PRIMARY KEY,
    course_name TEXT,
    credits INTEGER
)
""")

cursor.execute("""
CREATE TABLE enrollments (
    enrollment_id INTEGER PRIMARY KEY,
    student_id INTEGER,
    course_id INTEGER,
    grade TEXT,
    FOREIGN KEY(student_id) REFERENCES students(student_id),
    FOREIGN KEY(course_id) REFERENCES courses(course_id)
)
""")

# 3. Insert Data

In [14]:
students_data = [
    (1, "Zeeshan", 21, "Computer Science"),
    (2, "Samiya", 22, "Information Tech"),
    (3, "Farhan", 20, "Mathematics"),
    (4, "Meera", 23, "Statistics")
]

courses_data = [
    (101, "Database Systems", 3),
    (102, "Machine Learning", 4),
    (103, "Probability & Stats", 3)
]

enrollments_data = [
    (1, 1, 101, "A"),
    (2, 1, 102, "B"),
    (3, 2, 101, "A"),
    (4, 3, 103, "B"),
    (5, 4, 102, "A"),
    (6, 4, 103, "A")
]

cursor.executemany("INSERT INTO students VALUES (?, ?, ?, ?)", students_data)
cursor.executemany("INSERT INTO courses VALUES (?, ?, ?)", courses_data)
cursor.executemany("INSERT INTO enrollments VALUES (?, ?, ?, ?)", enrollments_data)
conn.commit()

# 4. COUNT ‚Äì How Many Students per Course?

In [15]:
query = """
SELECT c.course_name, COUNT(e.student_id) AS total_students
FROM enrollments e
JOIN courses c ON e.course_id = c.course_id
GROUP BY c.course_name
"""
pd.read_sql(query, conn)

           course_name  total_students
0     Database Systems               2
1     Machine Learning               2
2  Probability & Stats               2

# 5. AVG ‚Äì Average Age of Students per Major

In [16]:
query = """
SELECT major, AVG(age) AS avg_age
FROM students
GROUP BY major
"""
pd.read_sql(query, conn)

              major  avg_age
0  Computer Science     21.0
1  Information Tech     22.0
2       Mathematics     20.0
3        Statistics     23.0

# 6. HAVING ‚Äì Courses with More Than 1 Student

In [17]:
query = """
SELECT c.course_name, COUNT(e.student_id) AS total_students
FROM enrollments e
JOIN courses c ON e.course_id = c.course_id
GROUP BY c.course_name
HAVING COUNT(e.student_id) > 1
"""
pd.read_sql(query, conn)

           course_name  total_students
0     Database Systems               2
1     Machine Learning               2
2  Probability & Stats               2

# 7. MIN/MAX ‚Äì Highest & Lowest Age

In [18]:
query = "SELECT MIN(age) AS youngest, MAX(age) AS oldest FROM students"
pd.read_sql(query, conn)

   youngest  oldest
0        20      23

# ‚úÖ Summary (Day 17 ‚Äì Part 1):

- Learned GROUP BY with aggregate functions
- COUNT ‚Üí Students per course
- AVG ‚Üí Average student age per major
- HAVING ‚Üí Filtered groups with conditions
- MIN/MAX ‚Üí Youngest & oldest students